wfcxxd/stm32-Terminal/Core/Src/main.c
#include "main.h"
#include "gpio.h"
#include "spi.h"
#include "soft_i2c.h"

#include "ssd1306.h"
#include "DHT11.h"
#include "adc.h"
#include "tim.h"
#include <stdio.h>
#include <string.h>
#include "usart.h"
#include "nb_iot.h"
#include "bh1750.h"
#include "stm32_init.h"   // Read_VDDA_mV()

/* =============================================================================
 *                      配置与说明（保持页面顺序：ENV->LUX->NB）
 * =============================================================================
 * - 开机默认仍在 ENV 页（不强制跳到 NB 页）
 * - NB 页：两行窗口显示最近一次上报/回显的文本（不加省略号）
 * - 每 10 秒主动上报一行状态到服务器（可通过宏关闭）
 * - 电机：PB11 短按=进入/留在手动并启停；长按=退出手动回自动
 * - 顶部右侧：喇叭（告警），左 10px 风扇（占空比>0 时转），再左 10px “M”手动指示
 * - PWM 使用 TIM2_CH1@PA0（需在 CubeMX 里启用）
 * ============================================================================= */

#define WELCOME_SHOW_MS       5000u
#define SELFTEST_SHOW_MS      5000u
#define OLED_VISUAL_TEST_MS   0u
#define WELCOME_TUNE_ENABLE   1

#define WELCOME_TUNE_MS_MIN   1200u
#define WELCOME_TUNE_MS_MAX   4000u

/* OLED 刷新 & 心跳 LED */
#define OLED_REFRESH_MS       350u
#define HB_PERIOD_MS          2000u
#define HB_ON_MS              60u

/* ======== 温湿报警参数 ======== */
#define TEMP_HIGH             35
#define TEMP_LOW              24
#define TEMP_HYST              1

#define HUMI_HIGH             80
#define HUMI_LOW              35
#define HUMI_HYST              3

#define ALARM_COOLDOWN_MS  30000u

/* === NB 参数（按需修改） === */
#define NB_APN       "cmiot"
#define NB_SRV_IP    "1.2.3.4"
#define NB_SRV_PORT  9001

/* === 周期性上报开关与周期 === */
#define NB_DEMO_TX_ENABLE   1
#define NB_DEMO_PERIOD_MS   10000u

/* 页面定义（顺序保持：ENV -> LUX -> NB） */
typedef enum { PAGE_ENV = 0, PAGE_LUX = 1, PAGE_NB = 2, PAGE_COUNT = 3 } page_t;
static volatile page_t g_page = PAGE_ENV;

/* BH1750 运行期缓存 */
static HAL_StatusTypeDef g_bh1750_status = HAL_ERROR;
static float             g_last_lux      = 0.0f;
static uint32_t          g_next_lux_ms   = 0;

/* ====== 翻页键：PB10 下一页（低电平按下） ====== */
#define BTN_ACTIVE_LOW   1
#define BTN_NEXT_PORT    GPIOB
#define BTN_NEXT_PIN     GPIO_PIN_10

/* ====== 电机人工控制按键：PB11（低电平按下） ====== */
#define MOTOR_BTN_PORT   GPIOB
#define MOTOR_BTN_PIN    GPIO_PIN_11

/* ====== NB 页显示缓冲（不加省略号） ====== */
static char g_nb_last[64] = "--";

/* -------------------- 前置声明（仅本文件内部函数） -------------------- */
static void Buttons_Init(void);
static uint8_t NextPageButton_Scan10ms(void);

static void draw_centered6x8(int y, const char* s);
static void draw_centered6x8_ellipsized(int y, const char* s); // 备用
static void Beep_Tickle(void);
static inline void BEEP_SetFreq(uint32_t freq_hz);
static inline void BEEP_on(void);
static inline void BEEP_off(void);
static void PlayWelcomeMelody(uint32_t max_ms);
static inline void UI_NextPage(void){ g_page = (page_t)((g_page + 1) % PAGE_COUNT); }

/* =============================================================================
 *                         顶部右侧图标（8px 高）
 * ===========================================================================*/
#undef  SPEAKER_W
#define SPEAKER_W 12
#undef  SPEAKER_H
#define SPEAKER_H 8

/* 基础绘图小工具 */
static void draw_hline(int x,int y,int w){ for(int i=0;i<w;i++) SSD1306_DrawPixel(x+i,y,1); }
static void fill_rect(int x,int y,int w,int h){ for(int r=0;r<h;r++) draw_hline(x,y+r,w); }
static void clear_rect(int x,int y,int w,int h){
  for(int r=0;r<h;r++){
    for(int i=0;i<w;i++){ SSD1306_DrawPixel(x+i, y+r, 0); }
  }
}
static void draw_line(int x0,int y0,int x1,int y1){
  int dx = (x1>x0)? (x1-x0):(x0-x1), sx = (x0<x1)? 1:-1;
  int dy = -((y1>y0)? (y1-y0):(y0-y1)), sy = (y0<y1)? 1:-1;
  int err = dx + dy, e2;
  for(;;){
    SSD1306_DrawPixel(x0,y0,1);
    if (x0==x1 && y0==y1) break;
    e2 = 2*err;
    if (e2 >= dy){ err += dy; x0 += sx; }
    if (e2 <= dx){ err += dx; y0 += sy; }
  }
}

/* 扬声器图标（报警提示） */
static void Draw_SpeakerIcon(int x, int y){
  const int s = 2;
  const int square_x = x + 0;
  const int square_y = y + (SPEAKER_H - s)/2;
  const int rect_w = s;
  const int rect_h = 3 * s;
  const int rect_x = square_x + s;
  const int rect_y = square_y - (rect_h - s)/2;

  fill_rect(square_x, square_y, s, s);
  fill_rect(rect_x, rect_y, rect_w, rect_h);

  const int rx   = rect_x + rect_w;
  const int midy = rect_y + rect_h/2;
  const int Ls = 3;
  const int Lm = 5;
  draw_line(rx + 1, midy - 2, rx + 1 + Ls, midy - 3);
  draw_line(rx + 1, midy,     rx + 1 + Lm, midy);
  draw_line(rx + 1, midy + 2, rx + 1 + Ls, midy + 3);
}

/* 小风扇图标，phase 每次刷新+1 实现“旋转”动画 */
static void Draw_FanIcon_8x8(int x, int y, uint8_t phase){
  SSD1306_DrawPixel(x+4, y+4, 1);  // 中心点
  uint8_t p = phase & 0x03;
  const int dirs[4][3][2] = {
    {{ 0,-3},{ 3, 0},{-3, 0}},
    {{ 2,-2},{ 2, 2},{-2, 2}},
    {{ 0, 3},{ 3, 0},{-3, 0}},
    {{-2,-2},{ 2,-2},{-2, 2}},
  };
  for (int i=0;i<3;i++){
    int dx = dirs[p][i][0], dy = dirs[p][i][1];
    SSD1306_DrawPixel(x+4+dx, y+4+dy, 1);
    if (dx) SSD1306_DrawPixel(x+4+(dx>0?dx-1:dx+1), y+4+dy, 1);
    if (dy) SSD1306_DrawPixel(x+4+dx, y+4+(dy>0?dy-1:dy+1), 1);
  }
}

/* 手动模式图标（8x8，字母 'M'） */
static void Draw_ManualIcon_8x8(int x, int y){
  for (int i=0;i<8;i++){ // 立柱
    SSD1306_DrawPixel(x+1, y+i, 1);
    SSD1306_DrawPixel(x+6, y+i, 1);
  }
  // 顶部横线
  for (int i=1;i<=6;i++) SSD1306_DrawPixel(x+i, y, 1);
  // 中间形成 "M"
  SSD1306_DrawPixel(x+2, y+1, 1);
  SSD1306_DrawPixel(x+3, y+2, 1);
  SSD1306_DrawPixel(x+4, y+2, 1);
  SSD1306_DrawPixel(x+5, y+1, 1);
}

/* ===== NB 两行显示（不加省略号，超出宽度直接裁掉） ===== */
static void draw_nb_two_lines(int y1, int y2){
  const int chars_per_line = SSD1306_WIDTH / 6; // 21
  const char* s = g_nb_last;
  char l1[32]={0}, l2[32]={0};
  size_t len = strlen(s);

  if (len == 0) { strcpy(l1, "--"); l2[0]=0; }
  else {
    strncpy(l1, s, chars_per_line);
    l1[chars_per_line] = 0;
    if (len > (size_t)chars_per_line){
      strncpy(l2, s + chars_per_line, chars_per_line);
      l2[chars_per_line] = 0;
    }
  }

  clear_rect(0, y1, SSD1306_WIDTH, 8);
  clear_rect(0, y2, SSD1306_WIDTH, 8);

