wfcxxd/stm32-Terminal/Core/Src/main.c
  draw_centered6x8(y1, l1);
  if (l2[0]) draw_centered6x8(y2, l2);
}

/* ===== UI 小工具：6x8 字体整行居中 ===== */
static void draw_centered6x8(int y, const char* s){
  int w = SSD1306_StringWidth6x8(s);
  int x = (SSD1306_WIDTH - w)/2; if (x < 0) x = 0;
  SSD1306_DrawString(x, y, s);
}
/* 备用：单行省略号（NB 页不用） */
static void draw_centered6x8_ellipsized(int y, const char* s){
  const int maxChars = SSD1306_WIDTH / 6; // 128/6 ≈ 21
  size_t len = strlen(s);
  if (len <= (size_t)maxChars){ draw_centered6x8(y, s); return; }
  char tmp[72];
  size_t keep = (maxChars > 3) ? (size_t)(maxChars - 3) : 0;
  if (keep > sizeof(tmp)-4) keep = sizeof(tmp)-4;
  strncpy(tmp, s, keep);
  tmp[keep] = '\0';
  strcat(tmp, "...");
  draw_centered6x8(y, tmp);
}

/* ===== 心跳 LED & 蜂鸣器（TIM3_CH2 @ PB5） ===== */
#define LED_PORT GPIOC
#define LED_PIN  GPIO_PIN_13
static inline void LED_off(void){ HAL_GPIO_WritePin(LED_PORT, LED_PIN, GPIO_PIN_SET); }
static inline void LED_on(void){  HAL_GPIO_WritePin(LED_PORT, LED_PIN, GPIO_PIN_RESET); }
static void LED_Init(void){
  __HAL_RCC_GPIOC_CLK_ENABLE();
  GPIO_InitTypeDef g = {0};
  g.Pin = LED_PIN; g.Mode = GPIO_MODE_OUTPUT_PP; g.Pull = GPIO_NOPULL; g.Speed = GPIO_SPEED_FREQ_LOW;
  HAL_GPIO_Init(LED_PORT, &g); LED_off();
}
static inline void BEEP_on(void){
  uint32_t arr = __HAL_TIM_GET_AUTORELOAD(&htim3);
  __HAL_TIM_SET_COMPARE(&htim3, TIM_CHANNEL_2, (arr + 1)/2);
}
static inline void BEEP_off(void){ __HAL_TIM_SET_COMPARE(&htim3, TIM_CHANNEL_2, 0); }
static inline void BEEP_SetFreq(uint32_t freq_hz){
  if (freq_hz < 400)  freq_hz = 400;
  if (freq_hz > 5000) freq_hz = 5000;
  uint32_t timclk = 1000000UL;      // PSC=71 => 1 MHz
  uint32_t arr = (timclk / freq_hz); if (arr) arr -= 1;
  __HAL_TIM_SET_AUTORELOAD(&htim3, arr);
  __HAL_TIM_SET_COMPARE(&htim3, TIM_CHANNEL_2, (arr + 1)/2);
}
static void Beep_Tickle(void){
  uint32_t arr = __HAL_TIM_GET_AUTORELOAD(&htim3);
  __HAL_TIM_SET_COMPARE(&htim3, TIM_CHANNEL_2, arr); HAL_Delay(180);
  __HAL_TIM_SET_COMPARE(&htim3, TIM_CHANNEL_2, 0);   HAL_Delay(40);
  BEEP_SetFreq(2400); BEEP_on(); HAL_Delay(220); BEEP_off(); HAL_Delay(40);
}
static void Beep_Pattern(uint8_t times, uint16_t on_ms, uint16_t off_ms, uint16_t freq){
  BEEP_SetFreq(freq);
  for(uint8_t i=0;i<times;i++){ BEEP_on(); HAL_Delay(on_ms); BEEP_off(); HAL_Delay(off_ms); }
}

/* ===== 心跳 LED ===== */
static uint8_t  hb_on = 0;
static uint32_t hb_deadline = 0;
static uint32_t hb_next_start = 0;
static void Heartbeat_Task(uint32_t now_ms){
  if (!hb_on){
    if (now_ms >= hb_next_start){ LED_on(); hb_on = 1; hb_deadline = now_ms + HB_ON_MS; }
  }else{
    if (now_ms >= hb_deadline){ LED_off(); hb_on = 0; hb_next_start = now_ms + (HB_PERIOD_MS - HB_ON_MS); }
  }
}

/* ===== PB10/PB11 配置 ===== */
static void Buttons_Init(void){
  __HAL_RCC_GPIOB_CLK_ENABLE();
  GPIO_InitTypeDef g = {0};
  g.Mode  = GPIO_MODE_INPUT;
  g.Speed = GPIO_SPEED_FREQ_LOW;
#if BTN_ACTIVE_LOW
  g.Pull  = GPIO_PULLUP;
#else
  g.Pull  = GPIO_PULLDOWN;
#endif
  g.Pin   = BTN_NEXT_PIN;  HAL_GPIO_Init(BTN_NEXT_PORT, &g);   // PB10：翻页
  g.Pin   = MOTOR_BTN_PIN; HAL_GPIO_Init(MOTOR_BTN_PORT, &g);  // PB11：电机按钮
}
static uint8_t NextPageButton_Scan10ms(void){
  static uint8_t st=0, prev=0; static uint32_t t=0;
  uint32_t now = HAL_GetTick();
  uint8_t raw = ( BTN_ACTIVE_LOW ? (HAL_GPIO_ReadPin(BTN_NEXT_PORT,BTN_NEXT_PIN)==GPIO_PIN_RESET)
                                 : (HAL_GPIO_ReadPin(BTN_NEXT_PORT,BTN_NEXT_PIN)==GPIO_PIN_SET) );
  if (raw != st){ if (now - t >= 20){ st=raw; t=now; } } else { t=now; }
  uint8_t evt = 0; if (st && !prev) evt = 1; prev = st; return evt;
}

/* ===== 自检结果结构 ===== */
typedef struct {
  uint8_t oled_visual;
  uint8_t bh_found;
  uint8_t bh_addr;
  uint8_t bh_read_ok;
  uint8_t dht_ok;
  uint8_t bt_ok;        // 本版不检测，固定不显示
  uint8_t buzzer_ok;
  uint16_t vdd_mv;
  uint8_t  vdd_ok;
} SelfTestResult;

/* ===== 自检：BH1750 读一次；DHT11 重试；BEEP 线路切换检测 ===== */
static void RunSelfTest(SelfTestResult* r){
  memset(r, 0, sizeof(*r));

  if (OLED_VISUAL_TEST_MS > 0){ SSD1306_Fill(1); SSD1306_Update(); HAL_Delay(OLED_VISUAL_TEST_MS); }
  SSD1306_Fill(0); SSD1306_Update(); r->oled_visual = 1;

  r->vdd_mv = Read_VDDA_mV();
  r->vdd_ok = (r->vdd_mv >= 3000 && r->vdd_mv <= 3600);

  r->bh_found = 0; r->bh_read_ok = 0; r->bh_addr = 0x00;
  uint8_t try_addrs[2] = { BH1750_ADDR_LO, BH1750_ADDR_HI };
  for (int i=0;i<2;i++){
    uint8_t a = try_addrs[i];
    if (SoftI2C_Ping(a)){
      r->bh_found = 1; r->bh_addr = a;
      if (BH1750_Init(a, BH1750_CONT_HIRES) == HAL_OK){
        HAL_Delay(180);
        float tmp;
        if (BH1750_ReadLux(&tmp) == HAL_OK){
          r->bh_read_ok = 1;
          g_bh1750_status = HAL_OK; g_last_lux = tmp;
        }
      }
      break;
    }
  }

  DHT11_DataTypeDef dtmp = {0};
  for (int i=0;i<3;i++){ if (DHT11_Read(&dtmp) == HAL_OK){ r->dht_ok = 1; break; } HAL_Delay(150); }

  {
    uint32_t arr = __HAL_TIM_GET_AUTORELOAD(&htim3);
    __HAL_TIM_SET_COMPARE(&htim3, TIM_CHANNEL_2, arr); HAL_Delay(10);
    GPIO_PinState s_on = HAL_GPIO_ReadPin(GPIOB, GPIO_PIN_5);
    __HAL_TIM_SET_COMPARE(&htim3, TIM_CHANNEL_2, 0);   HAL_Delay(10);
    GPIO_PinState s_off = HAL_GPIO_ReadPin(GPIOB, GPIO_PIN_5);
    r->buzzer_ok = (s_on != s_off) ? 1 : 0;

    if (r->buzzer_ok){ BEEP_SetFreq(2000); BEEP_on(); HAL_Delay(120); BEEP_off(); }
    else             { Beep_Pattern(2, 60, 60, 1200); }
    HAL_Delay(20);
  }
}

/* ===== Lux 文本（1 位小数） ===== */
static void fmt_lux_1dp(char *buf, size_t n, float v){
  if (!buf || n < 8) return;
  int32_t lx10 = (int32_t)(v * 10 + (v >= 0 ? 0.5f : -0.5f));
  long ip = lx10 / 10; long fp = lx10 % 10; if (fp < 0) fp = -fp;
  snprintf(buf, n, "Lux: %ld.%ld lx", ip, fp);
}

/* ===== 开机曲：一闪一闪亮晶晶 ===== */
typedef struct { uint16_t f; uint8_t beats; } tw_note_t;
static void PlayWelcomeMelody(uint32_t max_ms){
  uint32_t target = max_ms;
  if (target < WELCOME_TUNE_MS_MIN) target = WELCOME_TUNE_MS_MIN;
  if (target > WELCOME_TUNE_MS_MAX) target = WELCOME_TUNE_MS_MAX;
  if (target > max_ms)              target = max_ms;
  Beep_Tickle();
  const tw_note_t song[] = {
    {523,1},{523,1},{784,1},{784,1},{880,1},{880,1},{784,2},
    {698,1},{698,1},{659,1},{659,1},{587,1},{587,1},{523,2},
  };
  const int N = (int)(sizeof(song)/sizeof(song[0]));
  uint32_t total_beats = 0; for (int i=0;i<N;i++) total_beats += song[i].beats;
  if (total_beats == 0) { HAL_Delay(target); return; }
  uint32_t beat_ms = target / total_beats; if (beat_ms < 110) beat_ms = 110;
  uint32_t spent = 0;
  for (int i=0;i<N;i++){
    uint32_t dur = beat_ms * song[i].beats;
    uint32_t on_ms = (dur * 85) / 100, off_ms = dur - on_ms;
    if (song[i].f){ BEEP_SetFreq(song[i].f); BEEP_on(); HAL_Delay(on_ms); BEEP_off(); }
    else { HAL_Delay(on_ms); }
    HAL_Delay(off_ms);
    spent += dur; if (spent >= target) break;
  }
  if (spent < target) HAL_Delay(target - spent);
}

/* ===== 时钟 & 错误处理 ===== */
void SystemClock_Config(void);
void Error_Handler(void);

/* ===== 温湿报警（≥/≤ 触发；迟滞+冷却） ===== */
typedef struct {
  uint8_t temp_abn; uint8_t humi_abn;
  uint32_t t_last; uint32_t h_last; uint32_t both_last;
} AlarmState;
static AlarmState g_alarm = {0,0,0,0,0};
static void Alarm_CheckAndBeep(const DHT11_DataTypeDef* d, uint32_t now_ms){
  if (!d) return;
  if (!g_alarm.temp_abn){
    if (d->temperature >= TEMP_HIGH || d->temperature <= TEMP_LOW) g_alarm.temp_abn = 1;
  }else if ((d->temperature <= (TEMP_HIGH - TEMP_HYST)) && (d->temperature >= (TEMP_LOW + TEMP_HYST))){
    g_alarm.temp_abn = 0;
  }
  if (!g_alarm.humi_abn){
    if (d->humidity >= HUMI_HIGH || d->humidity <= HUMI_LOW) g_alarm.humi_abn = 1;
  }else if ((d->humidity <= (HUMI_HIGH - HUMI_HYST)) && (d->humidity >= (HUMI_LOW + HUMI_HYST))){
    g_alarm.humi_abn = 0;
  }
  if (g_alarm.temp_abn && g_alarm.humi_abn){
    if (now_ms - g_alarm.both_last >= ALARM_COOLDOWN_MS){
      Beep_Pattern(5, 90, 60, 2700);
      g_alarm.both_last = g_alarm.t_last = g_alarm.h_last = now_ms;
    }
    return;
  }
  if (g_alarm.temp_abn && (now_ms - g_alarm.t_last >= ALARM_COOLDOWN_MS)){
    Beep_Pattern(2, 120, 120, 2400); g_alarm.t_last = now_ms;
  }
  if (g_alarm.humi_abn && (now_ms - g_alarm.h_last >= ALARM_COOLDOWN_MS)){
    Beep_Pattern(3, 110, 100, 2200); g_alarm.h_last = now_ms;
  }
}

