wfcxxd/stm32-Terminal/Core/Src/main.c
/* =============================================================================
 *                          ★★★ 电机控制（TIM2_CH1@PA0）★★★
 * ===========================================================================*/
/* 模式说明：
 * - AUTO：温度>32℃ 开始启动并线性提升；38℃ 达到 100%
 * - MANUAL：短按 PB11 在开/关切换，不退出手动；长按 PB11（≥1.5s）退出手动回自动
 */
typedef enum { MOTOR_AUTO=0, MOTOR_MANUAL=1 } motor_mode_t;
static struct {
  motor_mode_t mode;     // 当前模式
  uint8_t      manual_on;// 人工模式下 1=100%，0=0%
  uint8_t      duty_pct; // 当前输出占空比（0~100）
} g_motor = {MOTOR_AUTO, 0, 0};

static inline void MOTOR_StartPWM(void){ HAL_TIM_PWM_Start(&htim2, TIM_CHANNEL_1); }
static inline void MOTOR_SetDutyPct(uint8_t pct){
  if (pct > 100) pct = 100;
  uint32_t arr = __HAL_TIM_GET_AUTORELOAD(&htim2);
  uint32_t ccr = (uint32_t)((arr + 1) * pct / 100);
  __HAL_TIM_SET_COMPARE(&htim2, TIM_CHANNEL_1, ccr);
}
static uint8_t Motor_AutoDuty_FromTemp(int tempC){
  if (tempC <= 32) return 0;
  if (tempC >= 38) return 100;
  int delta = tempC - 32;                  // 1..6
  int duty  = 50 + (delta * 50) / 6;       // 32->~50%，38->100%
  if (duty < 0) duty = 0; if (duty > 100) duty = 100;
  return (uint8_t)duty;
}

/* ===== 每 10ms 调用一次，短按/长按事件去抖状态机 =====
 * 返回：0=无、1=短按、2=长按（长按只触发一次，直到松手不再有事件）
 */
static uint8_t MotorButton_Update10ms(void){
  static uint8_t  st  = 0;    // 去抖后的电平
  static uint8_t  fsm = 0;    // 0 idle, 1 pressed, 2 long_reported_wait_release
  static uint32_t t_edge = 0, t_press = 0;
  const uint32_t  LONG_MS = 1500;

  uint32_t now = HAL_GetTick();
  uint8_t raw = ( BTN_ACTIVE_LOW
                ? (HAL_GPIO_ReadPin(MOTOR_BTN_PORT, MOTOR_BTN_PIN)==GPIO_PIN_RESET)
                : (HAL_GPIO_ReadPin(MOTOR_BTN_PORT, MOTOR_BTN_PIN)==GPIO_PIN_SET) );

  // 简易去抖：20ms 稳定才改变 st
  if (raw != st){ if (now - t_edge >= 20){ st = raw; t_edge = now; } } else { t_edge = now; }

  switch (fsm){
    case 0: // idle
      if (st){ fsm = 1; t_press = now; }
      break;

    case 1: // 按下计时中
      if (st){
        if ((now - t_press) >= LONG_MS){
          fsm = 2;               // 长按已上报，直到松手不再有事件
          return 2;              // —— 长按事件（只触发一次）
        }
      }else{
        fsm = 0;
        return 1;                // —— 短按事件
      }
      break;

    case 2: // 等待松手
      if (!st) fsm = 0;
      break;
  }
  return 0;
}

/* =============================================================================
 *                                  主函数
 * ===========================================================================*/
int main(void)
{
  HAL_Init();
  SystemClock_Config();
  SystemCoreClockUpdate();

  MX_GPIO_Init();
  MX_SPI1_Init();
  MX_USART1_UART_Init();

  /* NB init (APN/IP/PORT) */
  NB_Init(NB_APN, NB_SRV_IP, NB_SRV_PORT);
  MX_ADC1_Init();

  /* TIM2 用作电机 PWM（CubeMX 需已开启 TIM2 CH1@PA0） */
  MX_TIM2_Init();
  MX_TIM3_Init();                               // 蜂鸣器
  HAL_TIM_PWM_Start(&htim3, TIM_CHANNEL_2);     // 播欢迎曲前确保 PWM 已启
  MOTOR_StartPWM();
  MOTOR_SetDutyPct(0);                          // 初始停转

  /* 欢迎页 */
  SSD1306_Init();
  SSD1306_Fill(0);
  {
    const int scale_x = 2, scale_y = 1;
    const int line_h  = 8 * scale_y;
    const int gap     = 12;
    const int total_h = line_h * 2 + gap;
    const int lift    = 4;
    int y0_base = (SSD1306_HEIGHT - total_h) / 2;
    int y0      = y0_base - lift;
    if (y0 < 0) y0 = 0;
    SSD1306_DrawStringCenteredScaled(y0,                "Welcome to",            1, scale_x, scale_y);
    SSD1306_DrawStringCenteredScaled(y0 + line_h + gap, "AI Farmland Terminal",  1, scale_x, scale_y);
  }
  SSD1306_Update();
#if WELCOME_TUNE_ENABLE
  PlayWelcomeMelody(WELCOME_SHOW_MS);
#else
  HAL_Delay(WELCOME_SHOW_MS);
#endif

  /* 自检前准备 */
  HAL_Delay(10);
  SoftI2C_Begin();

  /* 自检 */
  SelfTestResult st = {0};
  RunSelfTest(&st);

  char line[64];
  SSD1306_Fill(0);
  SSD1306_DrawStringCenteredScaled(0, "Hardware Check", 1, 2, 1);
  snprintf(line, sizeof(line), "OLED %s", st.oled_visual ? "OK" : "ERR");           draw_centered6x8(20, line);
  snprintf(line, sizeof(line), "BH1750 %s  DHT11 %s",
           (st.bh_found && st.bh_read_ok) ? "OK" : "ERR", st.dht_ok ? "OK" : "ERR");draw_centered6x8(32, line);

  /* NB 行固定显示 “NB loading...” */
  draw_centered6x8(44, "NB loading...");

  snprintf(line, sizeof(line), "VDD=%umV", (unsigned)st.vdd_mv);                     draw_centered6x8(56, line);
  SSD1306_Update();
  HAL_Delay(SELFTEST_SHOW_MS);

  /* 运行期变量 */
  Buttons_Init();
  BEEP_off();
  LED_Init();

  DHT11_DataTypeDef d = {0};
  uint8_t   have_valid_dht = st.dht_ok;
  uint32_t  next_dht_ms    = HAL_GetTick();
  const uint32_t DHT_PERIOD_MS = 2000;
  uint32_t  next_oled_ms   = HAL_GetTick();
  uint32_t  last_vdd_mv    = st.vdd_mv;
  HAL_StatusTypeDef last_dht_status = st.dht_ok ? HAL_OK : HAL_ERROR;

  if (!have_valid_dht){
    for (int i = 0; i < 5; i++) { if (DHT11_Read(&d) == HAL_OK){ have_valid_dht = 1; break; } HAL_Delay(250); }
  }

  static uint8_t fan_phase = 0;

  /* ============================== 主循环 ============================== */
  for (;;)
  {
    uint32_t now = HAL_GetTick();

    /* —— 按键 —— */
    static uint32_t next_btn_scan = 0;
    if (now >= next_btn_scan){
      next_btn_scan = now + 10;

      /* PB10: 下一页 */
      if (NextPageButton_Scan10ms() == 1) UI_NextPage();

      /* PB11: 电机按钮（短按=进入/留在手动并启停，长按=退出手动） */
      uint8_t mEvt = MotorButton_Update10ms();
      if (mEvt == 1){ // 短按
        if (g_motor.mode == MOTOR_AUTO){
          // 从自动 → 手动，并立即启动
          g_motor.mode = MOTOR_MANUAL;
          g_motor.manual_on = 1;
        }else{
          // 已在手动：启/停切换，不退出手动
          g_motor.manual_on = !g_motor.manual_on;
        }
      }else if (mEvt == 2){ // 长按：退出手动，回自动
        Beep_Pattern(1, 80, 0, 1800);
        g_motor.mode = MOTOR_AUTO;
        // 可选：退出时停转
        // g_motor.manual_on = 0;
      }
    }

    /* —— 传感器 —— */
    if (now >= g_next_lux_ms){
      float lx; HAL_StatusTypeDef stlux = BH1750_ReadLux(&lx);
      g_bh1750_status = stlux; if (stlux == HAL_OK) g_last_lux = lx;
      g_next_lux_ms = now + 500;
    }

    Heartbeat_Task(now);

    /* 供电监测 */
    last_vdd_mv = Read_VDDA_mV();
    uint8_t low_vdd = (last_vdd_mv < 3050);

