wfcxxd/stm32-Terminal/Core/Src/main.c
    /* DHT11 每 2 秒采样一次（低压跳过） */
    if (!low_vdd && now >= next_dht_ms) {
      HAL_StatusTypeDef st_d2 = DHT11_Read(&d);
      if (st_d2 != HAL_OK) { HAL_Delay(200); st_d2 = DHT11_Read(&d); }
      last_dht_status = st_d2;
      if (st_d2 == HAL_OK) have_valid_dht = 1;
      next_dht_ms = now + DHT_PERIOD_MS;
    }

    /* 报警判定 */
    if (!low_vdd && have_valid_dht && last_dht_status == HAL_OK){
      Alarm_CheckAndBeep(&d, now);
    }

#if NB_DEMO_TX_ENABLE
    static uint32_t next_demo_tx = 0;
    if (now >= next_demo_tx){
      char msg[64]; int n = 0;
      n += snprintf(msg+n, sizeof(msg)-n, "VDD=%lu", (unsigned long)last_vdd_mv);
      if (have_valid_dht && last_dht_status==HAL_OK){
        n += snprintf(msg+n, sizeof(msg)-n, " T=%dC H=%d%%", d.temperature, d.humidity);
      }
      if (g_bh1750_status==HAL_OK){
        int lux = (int)(g_last_lux + 0.5f);
        n += snprintf(msg+n, sizeof(msg)-n, " L=%d", lux);
      }
      NB_SendLine(msg);
      strncpy(g_nb_last, msg, sizeof(g_nb_last)-1);
      g_nb_last[sizeof(g_nb_last)-1]=0;
      next_demo_tx = now + NB_DEMO_PERIOD_MS;
    }
#endif

    /* —— 电机控制 —— */
    uint8_t target = 0;
    if (g_motor.mode == MOTOR_MANUAL){
      target = g_motor.manual_on ? 100 : 0;
    }else{
      if (have_valid_dht && last_dht_status == HAL_OK) target = Motor_AutoDuty_FromTemp((int)d.temperature);
      else target = 0;
    }
    MOTOR_SetDutyPct(target);
    g_motor.duty_pct = target;

    /* —— OLED 刷新 —— */
    if (now >= next_oled_ms) {
      SSD1306_Fill(0);

      if (low_vdd) {
        draw_centered6x8(0,  "LOW VDD!");
        snprintf(line, sizeof(line), "VDD=%lumV", (unsigned long)last_vdd_mv);
        draw_centered6x8(16, line);
        draw_centered6x8(32, "Check 5V/3V3");
      } else {
        /* 顶部左：标题 */
        SSD1306_DrawString(0, 0, "Hello STM32");

        /* 顶部右：报警喇叭（最右） */
        int right_x = SSD1306_WIDTH - SPEAKER_W;
        if (g_alarm.temp_abn || g_alarm.humi_abn){
          Draw_SpeakerIcon(right_x, 0);   // 12x8
        }
        /* 顶部右：风扇图标（在喇叭左边 10px，只有占空比>0 时显示并转动） */
        if (g_motor.duty_pct > 0){
          Draw_FanIcon_8x8(right_x - 10, 0, fan_phase++);
        }
        /* 顶部右：手动模式“M”图标（在风扇左边 10px，仅手动模式显示） */
        if (g_motor.mode == MOTOR_MANUAL){
          Draw_ManualIcon_8x8(right_x - 20, 0);
        }

        switch (g_page) {
          case PAGE_ENV: {
            draw_centered6x8(16, "DHT11");
            clear_rect(0, 28, SSD1306_WIDTH, 8);
            clear_rect(0, 36, SSD1306_WIDTH, 8);
            if (have_valid_dht && last_dht_status == HAL_OK) {
              snprintf(line, sizeof(line), "Tem:%2d C", d.temperature); draw_centered6x8(28, line);
              snprintf(line, sizeof(line), "Hum:%2d %%", d.humidity);   draw_centered6x8(36, line);
            } else {
              draw_centered6x8(28, "NO DHT11");
              draw_centered6x8(36, "or wiring error");
            }
            break;
          }
          case PAGE_LUX: {
            draw_centered6x8(16, "BH1750");
            clear_rect(0, 28, SSD1306_WIDTH, 8);
            clear_rect(0, 36, SSD1306_WIDTH, 8);
            if (g_bh1750_status == HAL_OK){
              fmt_lux_1dp(line, sizeof(line), g_last_lux); draw_centered6x8(28, line);
            }else{
              draw_centered6x8(28, "BH1750 N/A");
              draw_centered6x8(36, "Check ADDR/I2C");
            }
            break;
          }
          case PAGE_NB: {
            draw_centered6x8(16, "NB");
            draw_nb_two_lines(28, 36); // 两行空间
            clear_rect(0, 44, SSD1306_WIDTH, 8);
            snprintf(line, sizeof(line), "Baud:%lu", (unsigned long)huart1.Init.BaudRate);
            draw_centered6x8(44, line);
            break;
          }
          default: break;
        }

        /* 底部 VDD 居中（所有页面共用） */
        snprintf(line, sizeof(line), "VDD=%lu mV", (unsigned long)last_vdd_mv);
        draw_centered6x8(56, line);
      }

      SSD1306_Update();
      next_oled_ms = now + OLED_REFRESH_MS;
    }

    HAL_Delay(5);
  }
}

/* ===== 时钟配置（与工程一致） ===== */
void SystemClock_Config(void)
{
  RCC_OscInitTypeDef RCC_OscInitStruct = {0};
  RCC_ClkInitTypeDef RCC_ClkInitStruct = {0};
  RCC_OscInitStruct.OscillatorType = RCC_OSCILLATORTYPE_HSE;
  RCC_OscInitStruct.HSEState = RCC_HSE_ON;
  RCC_OscInitStruct.HSIState = RCC_HSI_ON;
  RCC_OscInitStruct.PLL.PLLState = RCC_PLL_ON;
  RCC_OscInitStruct.PLL.PLLSource = RCC_PLLSOURCE_HSE;
  RCC_OscInitStruct.PLL.PLLMUL = RCC_PLL_MUL9;
  if (HAL_RCC_OscConfig(&RCC_OscInitStruct) != HAL_OK) Error_Handler();
  RCC_ClkInitStruct.ClockType = RCC_CLOCKTYPE_HCLK|RCC_CLOCKTYPE_SYSCLK|RCC_CLOCKTYPE_PCLK1|RCC_CLOCKTYPE_PCLK2;
  RCC_ClkInitStruct.SYSCLKSource = RCC_SYSCLKSOURCE_PLLCLK;
  RCC_ClkInitStruct.AHBCLKDivider = RCC_SYSCLK_DIV1;
  RCC_ClkInitStruct.APB1CLKDivider = RCC_HCLK_DIV2;
  RCC_ClkInitStruct.APB2CLKDivider = RCC_HCLK_DIV1;
  if (HAL_RCC_ClockConfig(&RCC_ClkInitStruct, FLASH_LATENCY_2) != HAL_OK) Error_Handler();
}
void Error_Handler(void){
  __disable_irq();
  while(1){ HAL_GPIO_TogglePin(LED_PORT, LED_PIN); HAL_Delay(100); }
}
